; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v5 ?v11)
             (pred_12 ?v6 ?v9)
             (pred_11 ?v5 ?v9)
             (pred_3 ?v12 ?v5 )
	     (pred_4 ?v5)
             (pred_1 ?v2)
             (pred_6 ?v6)
             (pred_5 ?v9)
             (pred_2 ?v5)
             (pred_9 ?v6)
             (pred_8 ?v5)
             (pred_10 ))



(:action op_3
:parameters (?v4 ?v1 ?v13 ?v8)
:precondition (and (pred_1 ?v4) (pred_1 ?v1) (pred_6 ?v13) (pred_5 ?v8)
          (pred_7 ?v4 ?v1) (pred_12 ?v13 ?v8)
                   (pred_11 ?v1 ?v8) (pred_4 ?v4) 
                   (pred_2 ?v1) (pred_9 ?v13))
:effect (and  (pred_8 ?v1) (not (pred_2 ?v1))))


(:action op_4
:parameters (?v4 ?v3)
:precondition (and (pred_1 ?v4) (pred_1 ?v3)
               (pred_4 ?v4) (pred_7 ?v4 ?v3) (pred_8 ?v3))
:effect (and (pred_4 ?v3) (not (pred_4 ?v4))))

(:action op_2
:parameters (?v4 ?v13)
:precondition (and (pred_1 ?v4) (pred_6 ?v13) 
                  (pred_4 ?v4) (pred_3 ?v13 ?v4) (pred_10 ))
:effect (and (pred_9 ?v13)
   (not (pred_3 ?v13 ?v4)) (not (pred_10 ))))


(:action op_1
:parameters (?v4 ?v7 ?v10)
:precondition (and (pred_1 ?v4) (pred_6 ?v7) (pred_6 ?v10)
                  (pred_4 ?v4) (pred_9 ?v10) (pred_3 ?v7 ?v4))
:effect (and (pred_9 ?v7) (pred_3 ?v10 ?v4)
        (not (pred_9 ?v10)) (not (pred_3 ?v7 ?v4))))

(:action op_5
:parameters (?v4 ?v13)
:precondition (and (pred_1 ?v4) (pred_6 ?v13) 
                  (pred_4 ?v4) (pred_9 ?v13))
:effect (and (pred_10 ) (pred_3 ?v13 ?v4) (not (pred_9 ?v13)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_07 obj_05 obj_17 obj_16 obj_11 obj_14 obj_12 obj_08 obj_04 obj_15 obj_02 obj_13 obj_03 obj_09 obj_20
    obj_19 obj_01
    obj_10 obj_18
    )

    (:init
       (pred_10)

       (pred_1 obj_06)
       (pred_1 obj_07)
       (pred_1 obj_05)
       (pred_1 obj_17)
       (pred_1 obj_16)
       (pred_1 obj_11)
       (pred_1 obj_14)
       (pred_1 obj_12)
       (pred_1 obj_08)
       (pred_1 obj_04)
       (pred_1 obj_15)
       (pred_1 obj_02)
       (pred_1 obj_13)
       (pred_1 obj_03)
       (pred_1 obj_09)
       (pred_1 obj_20)
       (pred_5 obj_19)
       (pred_5 obj_01)
       (pred_6 obj_10)
       (pred_6 obj_18)

       (pred_7 obj_06 obj_16)
       (pred_7 obj_06 obj_07)
       (pred_7 obj_07 obj_11)
       (pred_7 obj_07 obj_05)
       (pred_7 obj_07 obj_06)
       (pred_7 obj_05 obj_14)
       (pred_7 obj_05 obj_17)
       (pred_7 obj_05 obj_07)
       (pred_7 obj_17 obj_12)
       (pred_7 obj_17 obj_05)
       (pred_7 obj_16 obj_08)
       (pred_7 obj_16 obj_11)
       (pred_7 obj_16 obj_06)
       (pred_7 obj_11 obj_04)
       (pred_7 obj_11 obj_14)
       (pred_7 obj_11 obj_07)
       (pred_7 obj_11 obj_16)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_14 obj_12)
       (pred_7 obj_14 obj_05)
       (pred_7 obj_14 obj_11)
       (pred_7 obj_12 obj_02)
       (pred_7 obj_12 obj_17)
       (pred_7 obj_12 obj_14)
       (pred_7 obj_08 obj_13)
       (pred_7 obj_08 obj_04)
       (pred_7 obj_08 obj_16)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_04 obj_15)
       (pred_7 obj_04 obj_11)
       (pred_7 obj_04 obj_08)
       (pred_7 obj_15 obj_09)
       (pred_7 obj_15 obj_02)
       (pred_7 obj_15 obj_14)
       (pred_7 obj_15 obj_04)
       (pred_7 obj_02 obj_20)
       (pred_7 obj_02 obj_12)
       (pred_7 obj_02 obj_15)
       (pred_7 obj_13 obj_03)
       (pred_7 obj_13 obj_08)
       (pred_7 obj_03 obj_09)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_03 obj_13)
       (pred_7 obj_09 obj_20)
       (pred_7 obj_09 obj_15)
       (pred_7 obj_09 obj_03)
       (pred_7 obj_20 obj_02)
       (pred_7 obj_20 obj_09)
       (pred_2 obj_09)
       (pred_2 obj_02)
       (pred_11  obj_09 obj_19)
       (pred_11  obj_02 obj_01)
       (pred_8 obj_06)
       (pred_8 obj_07)
       (pred_8 obj_05)
       (pred_8 obj_17)
       (pred_8 obj_16)
       (pred_8 obj_11)
       (pred_8 obj_14)
       (pred_8 obj_12)
       (pred_8 obj_08)
       (pred_8 obj_04)
       (pred_8 obj_15)
       (pred_8 obj_13)
       (pred_8 obj_03)
       (pred_8 obj_20)

       (pred_12  obj_10 obj_19)
       (pred_12  obj_18 obj_01)
       (pred_3 obj_10 obj_20)
       (pred_3 obj_18 obj_08)
       (pred_4 obj_11)
    )

    (:goal (and
       (pred_3 obj_18 obj_15)
    ))
(:constraints
  (always (not (pred_4 obj_04)))
)
)

; plan
1. (op_4 obj_11 obj_16)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_16)
   goals met: 0 of 1
2. (op_4 obj_16 obj_08)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_08)
   goals met: 0 of 1
3. (op_2 obj_08 obj_18)
   deleted: (pred_3 obj_18 obj_08) (pred_10)
   added: (pred_9 obj_18)
   goals met: 0 of 1
4. (op_4 obj_08 obj_16)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_16)
   goals met: 0 of 1
5. (op_4 obj_16 obj_11)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_11)
   goals met: 0 of 1
6. (op_4 obj_11 obj_14)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_14)
   goals met: 0 of 1
7. (op_4 obj_14 obj_15)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_15)
   goals met: 0 of 1
8. (op_5 obj_15 obj_18)
   deleted: (pred_9 obj_18)
   added: (pred_10) (pred_3 obj_18 obj_15)
   goals met: 1 of 1
